{
    "title": "Day 6 - Learned about animations, chess, Angular and insurance",
    "content": "<div><ul><li><span>Today I completed the domino animation. I added colors and sound to it. I also started making another animation with the same concept but instead of a tower of cubes, I used large cuboids and to give the animation a domino effect.<\/span><\/li><\/ul><ul><li><span>Today I reached the rating of 896 in Blitz, 956 in Rapid, and 964 in Bullet. I discovered a platform called <a href=\"https:\/\/decodechess.com\/\" target=\"_blank\">Decode Chess<\/a>. It is an AI-powered app for chess improvement. Other chess engines only tell the best move in the position but <a href=\"https:\/\/decodechess.com\/\" target=\"_blank\">Decode Chess<\/a> tells why the move is the best. It is a good platform to analyze your games and learn from them.<\/span><\/li><\/ul><ul><li><span>I started learning angular from the YouTube channel <a href=\"https:\/\/www.youtube.com\/c\/CodeWithHarry\/videos\" target=\"_blank\">CodeWithHarry<\/a>. Today I completed the introduction part and faced some problems in the setup of the Angular environment. I did whatever I could but in the end, the solution was not to host the website on VSCode live server (port 5500) instead it should be hosted on http:\/\/localhost:4200\/ and I learned that it is always useful to read the documentation.<\/span><\/li><\/ul><ul><li><span>I watched the third episode of <a href=\"https:\/\/youtube.com\/playlist?list=PLLbfvOX935JFYAHk4u4i9zI1oOyUNcbli\" target=\"_blank\">Understanding Insurance<\/a> and today I learned about health insurance and why it should be different for you and your parents. Today's topic was how to choose health insurance for your parents. I also learned about some important points to take into consideration like there should be no room rent capping and minimum waiting period.<\/span><\/li><\/ul><\/div>",
    "author": "Aarush Popli",
    "slug": "day-06-learned-about-animations-chess-angular-and-insurance",
    "metadesc": "Today I completed the domino animation. I added colors and sound to it. I also started making another animation with the same concept but instead of ..."
}